Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АкцизныеМарки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодАкцизнойМарки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КодАкцизнойМарки</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/КассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КассыККМ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРаспределенияВыручкиПоСекциям</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРаспределенияВыручкиПоСекциямФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ххх_ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеВидовОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоответствиеВидовОплатыСККМOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКассККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРучнойРежимФормированияЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФормироватьНефискальныеЧеки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЧекаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЧекаККМВозврат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКПапкеВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКПапкеЗагрузке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ххх_СтрокаСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ххх_ИмяПользователяКассы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ххх_ТипСубд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ххх_ТипКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ххх_ТипыКасс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЛенты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекEmailПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекSMSПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЧекККМ/Forms/ххх_ФормаСписка/Ext/Form/Module.bsl
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеВопросВнесениеДенегВКассуККМ(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВнесениеДенегВКассуККМ(ДополнительныеПараметры.ПараметрДействия)
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВводЧислаИзымаемойСуммыЗавершение(РезультатОперации, ПараметрыОперации) Экспорт;
	
	Если РезультатОперации <> Неопределено И РезультатОперации.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Выполнена выемка денежных средств из %КассаККМ% на сумму %ИзымаемаяСумма%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КассаККМ%", Строка(РезультатОперации.КассаККМ));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИзымаемаяСумма%", Формат(РезультатОперации.ИзымаемаяСумма, "ЧЦ=15; ЧДЦ=2"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Если ПараметрыОперации.ПоследняяОперация Тогда
		ЭтаФорма.Доступность = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОперации.ТекущийЭлемент < ПараметрыОперации.КоличествоЭлементов Тогда
		
		СтрокаВыручки = ПараметрыОперации.СписокВидовВыручки.Получить(ПараметрыОперации.ТекущийЭлемент);
		ПараметрыОперации.ТекущийЭлемент = ПараметрыОперации.ТекущийЭлемент + 1;
		
		Если ПараметрыОперации.ОсталосьИзъять = 0 Тогда
			ЭтаФорма.Доступность = Истина;
			Возврат;
		КонецЕсли;
			
		Если СтрокаВыручки.СуммаОстаток >= ПараметрыОперации.ОсталосьИзъять Тогда
			СуммаВыемки = ПараметрыОперации.ОсталосьИзъять;
			ПараметрыОперации.ОсталосьИзъять = 0;
		Иначе
			СуммаВыемки = СтрокаВыручки.СуммаОстаток;
			ПараметрыОперации.ОсталосьИзъять = ПараметрыОперации.ОсталосьИзъять - СтрокаВыручки.СуммаОстаток;
		КонецЕсли;
			
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДоговорПлатежногоАгента", СтрокаВыручки.ДоговорПлатежногоАгента);
		
		ПараметрыВыполнения = ДенежныеСредстваКлиент.ПараметрыВыполненияОперацииВыемкаДенег();
		ПараметрыВыполнения.ИзымаемаяСумма = СуммаВыемки;
		ПараметрыВыполнения.КассаККМ = КассаККМ;
		ПараметрыВыполнения.УникальныйИдентификатор = УникальныйИдентификатор;
		ПараметрыВыполнения.ДополнительныеПараметры = ДополнительныеПараметры; 
		
		Оповещение = Новый ОписаниеОповещения("ОповещениеВводЧислаИзымаемойСуммыЗавершение", ЭтотОбъект, ПараметрыОперации);
		ДенежныеСредстваКлиент.НачатьВыемкуДенег(Оповещение, ПараметрыВыполнения); 
		
	Иначе
		
		Если ПараметрыОперации.ОсталосьИзъять  > 0 Тогда
			
			ПараметрыОперации.ПоследняяОперация = Истина;
			ПараметрыВыполнения = ДенежныеСредстваКлиент.ПараметрыВыполненияОперацииВыемкаДенег();
			ПараметрыВыполнения.ИзымаемаяСумма = ПараметрыОперации.ОсталосьИзъять;
			ПараметрыВыполнения.КассаККМ = КассаККМ;
			ПараметрыВыполнения.УникальныйИдентификатор = УникальныйИдентификатор;
			
			Оповещение = Новый ОписаниеОповещения("ОповещениеВводЧислаИзымаемойСуммыЗавершение", ЭтотОбъект, ПараметрыОперации);
			ДенежныеСредстваКлиент.НачатьВыемкуДенег(Оповещение, ПараметрыВыполнения); 
			
		Иначе
			ЭтаФорма.Доступность = Истина;
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВводЧислаИзымаемойСуммы(ЗначениеЧисла, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЧисла = Неопределено И ЗначениеЧисла > 0 Тогда
		
		ОсталосьИзъять = ЗначениеЧисла;
		ЗаполнитьСписокВидовВыручки();
		
		ПараметрыОперации = Новый Структура();
		ПараметрыОперации.Вставить("СписокВидовВыручки" , СписокВидовВыручки);
		ПараметрыОперации.Вставить("КоличествоЭлементов", СписокВидовВыручки.Количество());
		ПараметрыОперации.Вставить("ТекущийЭлемент"     , 0);
		ПараметрыОперации.Вставить("ОсталосьИзъять"     , ОсталосьИзъять);
		ПараметрыОперации.Вставить("ПоследняяОперация"  , Ложь);
		
		ЭтаФорма.Доступность = Ложь;
		ОповещениеВводЧислаИзымаемойСуммыЗавершение(Неопределено, ПараметрыОперации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуЗакрытияКассовойСмены(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	УстановитьДоступностьКомандСозданияДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуПроверкиНепробитыхЧеков(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если РезультатОткрытияФормы = НСтр("ru = 'Закрытие смены'") Тогда
		ПродолжитьОткрытиеОбработкиЗакрытияКассовойСмены();
	Иначе
		
		ТекстОшибки = НСтр("ru = 'Закрытие кассовой смены прервано пользователем.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВводаСуммыФактическойВыемки(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	СуммаФактическойВыемки = 0;
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		ЗначениеВыбораЧисло = РезультатОткрытияФормы.ВведенноеЧисло;
		Если ЗначениеЗаполнено(ЗначениеВыбораЧисло) Тогда
			СуммаФактическойВыемки = ЗначениеВыбораЧисло;
		КонецЕсли;
		
		ЗавершитьОткрытиеОбработкиЗакрытияКассовойСмены(СуммаФактическойВыемки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	ИспользоватьПодключаемоеОборудование = ЗначениеНастроекВызовСервера.ИспользоватьПодключаемоеОборудование();
	ИспользоватьАгентскиеПлатежи = ПолучитьФункциональнуюОпцию("ИспользоватьАгентскиеПлатежиИРазделениеВыручки");
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Организация = Справочники.Организации.ПолучитьОрганизациюПоУмолчанию();
	КонецЕсли;

	УстановитьОтборДинамическихСписковПриИзмененииСервер();
	
	ОбщегоНазначенияРТ.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список", "Дата");
	ОбщегоНазначенияРТ.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "СписокРасходныеОрдераКВнесениюДенег", "СписокРасходныеОрдераКВнесениюДенегДата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьКомандСозданияДокументов();
	УстановитьДоступностьКассы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Вставить содержимое обработчика.
	Если ИмяСобытия = "ИзменениеСостоянияКассовойСмены" 
	   И КассаККМ = Параметр Тогда
		УстановитьДоступностьКомандСозданияДокументов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	КассаККМ = Настройки.Получить("КассаККМ");
	Магазин  = Настройки.Получить("Магазин");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Организация = Настройки.Получить("Организация");
	Иначе
		Организация = Справочники.Организации.ПолучитьОрганизациюПоУмолчанию();
		
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			КассаККМ = Справочники.КассыККМ.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьОтборДинамическихСписковПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборМагазинПриИзменении(Элемент)
	
	УстановитьОтборДинамическихСписковПриИзмененииКлиент();
	УстановитьДоступностьКомандСозданияДокументов();
	УстановитьДоступностьКассы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьОтборДинамическихСписковПриИзмененииКлиент();
	УстановитьДоступностьКомандСозданияДокументов();
	УстановитьДоступностьКассы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКассаККМПриИзменении(Элемент)
	
	УстановитьОтборДинамическихСписковПриИзмененииКлиент();
	УстановитьДоступностьКомандСозданияДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРасходныеОрдераКВнесениюДенег

&НаКлиенте
Процедура СписокРасходныеОрдераКВнесениюДенегВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыполнитьВнесениеДенегВКассуККМКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьКассовуюСмену(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
		ТекстОшибки = НСтр("ru='Выберите кассу ККМ!'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			"КассаККМ"
		);
		
		Возврат;
	КонецЕсли;
	
	Если НЕ ВозможностьЗакрытияСмены() Тогда
		УстановитьДоступностьКомандСозданияДокументов();
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуПроверкиНепробитыхЧеков", ЭтотОбъект);
	ПройденаПроверкаНепробитыхЧеков = РозничныеПродажиКлиент.ПройденаПроверкаНепробитыхЧеков(КассаККМ, ОбработчикОповещения);
	
	Если ПройденаПроверкаНепробитыхЧеков Тогда
		ПродолжитьОткрытиеОбработкиЗакрытияКассовойСмены();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКСпискуЧековККМ(Команда)
	
	УстановитьТекущуюСтраницуФормы(Элементы.ГруппаСписокЧековККМ);
	
КонецПроцедуры

// Процедура вызывается при нажатии на кнопку "Внесение денег".
//
&НаКлиенте
Процедура ВнесениеДенегВКассу(Команда)
	
	ОчиститьСообщения();
	
	ОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокРасходныеОрдераКВнесениюДенег, "Организация", Организация);
	ОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокРасходныеОрдераКВнесениюДенег, "КассаККМ", КассаККМ);

	УстановитьТекущуюСтраницуФормы(Элементы.ГруппаВнесениеДенег);
	
КонецПроцедуры

// Процедура вызывается при нажатии на кнопку "Выемка денег".
//
&НаКлиенте
Процедура ВыемкаДенег(Команда)
	
	ОчиститьСообщения();
	
	ТекстПодсказки = НСтр("ru='Сумма выемки из кассы %1'"); 
	
	ТекстПодсказки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ТекстПодсказки,
						КассаККМ);
						
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВводЧислаИзымаемойСуммы", ЭтотОбъект);
	НачальноеЗначение = 0;
	ПоказатьВводЧисла(ОбработчикОповещения, НачальноеЗначение, ТекстПодсказки, 15, 2);
	
КонецПроцедуры

// Процедура выполняет создание документа внесение денежных средств в кассу ККМ.
//
&НаКлиенте
Процедура СоздатьДокументВнесениеДенежныхСредствВКассу(Команда)
	
	ВыполнитьВнесениеДенегВКассуККМКлиент();
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура создания документа внесение денежных средств в кассу ККМ.
//
&НаКлиенте
Процедура ВыполнитьВнесениеДенегВКассуККМКлиент()
	Перем ПараметрСуммаВнесения;
	
	ТекущиеДанные = Элементы.СписокРасходныеОрдераКВнесениюДенег.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрДействия = Новый Структура;
	
	ПараметрДействия.Вставить("СуммаВнесения",ТекущиеДанные.СуммаВнесения);
	ПараметрДействия.Вставить("Ссылка",ТекущиеДанные.Ссылка);
	ПараметрДействия.Вставить("КассаККМ",ТекущиеДанные.КассаККМ);
	
	Если ТекущиеДанные.Свойство("СуммаВнесения", ПараметрСуммаВнесения) И ПараметрСуммаВнесения <= 0.00 Тогда
		Текст = НСтр("ru = 'По выбранному документу не требуется выполнять внесение денежных средств в кассу ККМ'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	Иначе
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Будет выполнено внесение денежных средств в кассу %1 на сумму %2 руб. %3По документу %4%5Продолжить?'"),
							ТекущиеДанные.КассаККМ,
							Формат(ТекущиеДанные.СуммаВнесения, "ЧЦ=15; ЧДЦ=2"),
							Символы.ПС,
							Строка(ТекущиеДанные.Ссылка),
							Символы.ПС
						);
		
		ДополнительныеПараметры = Новый Структура; 
		ДополнительныеПараметры.Вставить("ПараметрДействия", ПараметрДействия);
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросВнесениеДенегВКассуККМ", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, 
					   РежимДиалогаВопрос.ДаНет,,
					   КодВозвратаДиалога.Да, 
					   НСтр("ru = 'Внесение денежных средств в кассу по документу'") + " " + Строка(ТекущиеДанные.Ссылка));
		
	КонецЕсли;
	
КонецПроцедуры

// Завершает на клиенте внесение денег в кассу ККМ.
//
&НаКлиенте
Процедура ЗавершитьВнесениеДенегВКассуККМ(ПараметрДействия)
	
	ПараметрыВыполнения = ДенежныеСредстваКлиент.ПараметрыВыполненияОперацииВнесениеДенег();
	ПараметрыВыполнения.СуммаВнесения = ПараметрДействия.СуммаВнесения; 
	ПараметрыВыполнения.РКО = ПараметрДействия.Ссылка; 
	ПараметрыВыполнения.КассаККМ = ПараметрДействия.КассаККМ;
	ПараметрыВыполнения.УникальныйИдентификатор = УникальныйИдентификатор;
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВнесениеДенегВКассуККМЗавершение", ЭтотОбъект, ПараметрыВыполнения);
	ДенежныеСредстваКлиент.НачатьВнесениеДенег(Оповещение, ПараметрыВыполнения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВнесениеДенегВКассуККМЗавершение(РезультатВыполнения, ПараметрыВыполнения) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ВернутьсяКСпискуЧековККМ(Команды.ВернутьсяКСпискуЧековККМ);
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик команды "ОткрытьКассовуюСмену".
//
&НаКлиенте
Процедура ОткрытьКассовуюСмену(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
		ТекстОшибки = НСтр("ru='Выберите кассу ККМ!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ,"КассаККМ");
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	ТекстПереходящегоОстатка = "";
	
	ПараметрыКассыККМ       = ЗначениеНастроекВызовСервера.ПолучитьПараметрыКассыККМ(КассаККМ);
	ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
	ИспользоватьКассуККМБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;

	Если ИспользоватьПодключаемоеОборудование И НЕ ИспользоватьКассуККМБезПодключенияОборудования И ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
		ЭтаФорма.Доступность = Ложь;
		Оповещение = Новый ОписаниеОповещения("ОткрытьКассовуюСменуЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ИдентификаторУстройства, Ложь);
	Иначе
		Результат = ОткрытьКассовуюСменуНаСервереБезКонтекста(КассаККМ, ОписаниеОшибки, ТекстПереходящегоОстатка);
		Если Не Результат Тогда
			ТекстСообщения = НСтр("ru = 'При открытии смены произошла ошибка.
			                            |Смена не открыта.
			                            |Дополнительное описание:
			                            |%ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ИначеЕсли ЗначениеЗаполнено(ТекстПереходящегоОстатка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПереходящегоОстатка);
		КонецЕсли;
		УстановитьДоступностьКомандСозданияДокументов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКассовуюСменуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтаФорма.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда 
		ОписаниеОшибки = "";
		ТекстПереходящегоОстатка = "";
		Результат = ОткрытьКассовуюСменуНаСервереБезКонтекста(КассаККМ, ОписаниеОшибки, ТекстПереходящегоОстатка);
		Если Не Результат Тогда
			ТекстСообщения = НСтр("ru = 'При открытии смены произошла ошибка. Смена не открыта.
							       |Дополнительное описание: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ИначеЕсли ЗначениеЗаполнено(ТекстПереходящегоОстатка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПереходящегоОстатка);
		КонецЕсли;
		УстановитьДоступностьКомандСозданияДокументов();
	Иначе
		ТекстСообщения = НСтр("ru = 'При открытии смены произошла ошибка.
			                      |Смена не открыта на фискальном регистраторе.
			                      |%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры


// Функция выполняет открытие кассовой смены на сервере.
//
&НаСервереБезКонтекста
Функция ОткрытьКассовуюСменуНаСервереБезКонтекста(КассаККМ, ОписаниеОшибки = "", ТекстПереходящегоОстатка = "")
	
	Возврат РозничныеПродажиСервер.ОткрытьКассовуюСмену(КассаККМ, ОписаниеОшибки, ТекстПереходящегоОстатка);
	
КонецФункции

&НаСервере
Функция ВозможностьЗакрытияСмены()
	
	СтруктураСостояниеКассовойСмены = РозничныеПродажиСервер.ПолучитьСостояниеКассовойСмены(КассаККМ);
	
	Если НЕ СтруктураСостояниеКассовойСмены.СменаОткрыта Тогда
		
		ТекстОшибки = НСтр("ru='Кассовая смена не открыта!'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			"КассаККМ"
		);
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Процедура устанавливает доступность кнопкам формы "ВнесениеДенег" и "ВыемкаДенег", если заполнено значение касса ККМ.
//
&НаКлиенте
Процедура УстановитьДоступностьКомандСозданияДокументов()
	
	ДоступностьЭлемента = ЗначениеЗаполнено(КассаККМ);
	
	СостояниеКассовойСмены = РозничныеПродажиВызовСервера.ПолучитьСостояниеКассовойСмены(КассаККМ);
	СменаОткрыта = СостояниеКассовойСмены.СменаОткрыта;
	
	ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВнесениеДенег"       , "Доступность", ДоступностьЭлемента И СменаОткрыта);
	ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыемкаДенег"         , "Доступность", ДоступностьЭлемента И СменаОткрыта);
	ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОткрытьКассовуюСмену", "Доступность", ДоступностьЭлемента И НЕ СменаОткрыта);
	ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СнятьZОтчет"         , "Доступность", ДоступностьЭлемента И СменаОткрыта);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинамическихСписковПриИзмененииКлиент()
	
	УстановитьОтборДинамическихСписковПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическихСписковПриИзмененииСервер()
	
	УстановитьОтборДинамическихСписков("Магазин");
	УстановитьОтборДинамическихСписков("Организация");
	УстановитьОтборДинамическихСписков("КассаККМ");
	
КонецПроцедуры

// Процедура выполняет переход на страницу переданную в параметре.
// Параметры:
//           ТекущаяСтраница - ЭлементФормы - Страница, на которую необходимо перейти, сделать активной.
&НаКлиенте
Процедура УстановитьТекущуюСтраницуФормы(ТекущаяСтраница)
	
	Элементы.ГруппаСписок.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОткрытиеОбработкиЗакрытияКассовойСмены()
	
	СуммаФактическойВыемки = 0;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВводаСуммыФактическойВыемки", ЭтотОбъект);
	СуммаВыемкиЗапрошена = РозничныеПродажиКлиент.ЗапроситьСуммуФактическойВыемки(КассаККМ, ОбработчикОповещения, УникальныйИдентификатор);
	Если НЕ СуммаВыемкиЗапрошена Тогда
		ЗавершитьОткрытиеОбработкиЗакрытияКассовойСмены(СуммаФактическойВыемки);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьОткрытиеОбработкиЗакрытияКассовойСмены(СуммаФактическойВыемки = 0)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КассаККМ"              , КассаККМ);
	ПараметрыФормы.Вставить("ВыполнитьЗакрытиеСразу", Истина);
	ПараметрыФормы.Вставить("СуммаФактическойВыемки", СуммаФактическойВыемки);
	
	ОбработчикОповещения= Новый ОписаниеОповещения("ОповещениеОткрытьФормуЗакрытияКассовойСмены", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("Обработка.ЗакрытиеКассовойСмены.Форма.Форма", ПараметрыФормы,ЭтотОбъект,,,, ОбработчикОповещения, Режим);
	
	УстановитьДоступностьКомандСозданияДокументов();
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// Прочее

// Процедура устанавливает отбор динамических списков формы.
//
&НаСервере
Процедура УстановитьОтборДинамическихСписков(ИмяРеквизита)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		ИмяРеквизита, 
		ЭтотОбъект[ИмяРеквизита], 
		ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]));
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		СписокРасходныеОрдераКВнесениюДенег, 
		ИмяРеквизита, 
		ЭтотОбъект[ИмяРеквизита], 
		ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]));
		
	
	ОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(
		СписокРасходныеОрдераКВнесениюДенег, 
		ИмяРеквизита, 
		ЭтотОбъект[ИмяРеквизита]);
		
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКассы()
	
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Магазин) Тогда
		Элементы.ОтборКассаККМ.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ОтборКассаККМ.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВидовВыручки()
	
	ФинансыСервер.ЗаполнитьСписокВидовВыручки(СписокВидовВыручки, КассаККМ);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСменыПриИзменении(Элемент)
	УстановитьОтборДинамическихСписков("НомерСменыККМ");
	Если ЗначениеЗаполнено(ЭтаФорма.НомерСменыККМ) Тогда
		элементы.ФормаПроверитьЧекиЗаВыбраннуюСмену.видимость=Истина;
	Иначе
		элементы.ФормаПроверитьЧекиЗаВыбраннуюСмену.видимость=Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


&НаСервере
Процедура ПроверитьЧекиЗаВыбраннуюСменуНаСервере()
	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("НомерСмены",ЭтаФорма.НомерСменыККМ);
	Запрос.Текст="ВЫБРАТЬ
	             |	СУММА(ЧекККМСкидкиНаценки.Сумма) КАК Сумма,
	             |	ЧекККМСкидкиНаценки.Ссылка КАК Ссылка
	             |ПОМЕСТИТЬ скидки
	             |ИЗ
	             |	Документ.ЧекККМ.СкидкиНаценки КАК ЧекККМСкидкиНаценки
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ЧекККМСкидкиНаценки.Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЧекККМТовары.Ссылка КАК Ссылка,
	             |	СУММА(ЧекККМТовары.Сумма) КАК Сумма
	             |ПОМЕСТИТЬ товары
	             |ИЗ
	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ЧекККМТовары.Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	товары.Ссылка КАК Ссылка,
	             |	СУММА(товары.Сумма - ЕСТЬNULL(скидки.Сумма, 0)) КАК Сумма
	             |ПОМЕСТИТЬ ИтогТабЧастей
	             |ИЗ
	             |	товары КАК товары
	             |		ЛЕВОЕ СОЕДИНЕНИЕ скидки КАК скидки
	             |		ПО товары.Ссылка = скидки.Ссылка
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	товары.Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ИтогТабЧастей.Ссылка КАК Ссылка
	             |ИЗ
	             |	ИтогТабЧастей КАК ИтогТабЧастей
	             |ГДЕ
	             |	ИтогТабЧастей.Ссылка.СуммаДокумента <> ИтогТабЧастей.Сумма";
	массив=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если массив.Количество()>0 тогда
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"Ссылка", 
			массив, 
			истина,
			ВидСравненияКомпоновкиДанных.ВСписке);
	Для каждого эл из массив Цикл
		Сообщить("В чеке №"+эл.НомерЧекаККМ+" некорректно заполнена сумма.");
	КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЧекиЗаВыбраннуюСмену(Команда)
	Элементы.ФормаПроверитьЧекиЗаВыбраннуюСмену.Пометка=не Элементы.ФормаПроверитьЧекиЗаВыбраннуюСмену.Пометка;
	Если Элементы.ФормаПроверитьЧекиЗаВыбраннуюСмену.Пометка Тогда
		ПроверитьЧекиЗаВыбраннуюСменуНаСервере();
	Иначе
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"Ссылка", 
			"", 
			ложь,
			ВидСравненияКомпоновкиДанных.ВСписке);

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЧекиЗаСмены(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
